app/controllers/comments_controller.rb

	def create
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.create(comment_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "아이고"], ["blog_id", 10], ["created_at", "2022-03-10 08:34:11.783795"], ["updated_at", "2022-03-10 08:34:11.783795"]]

	def destroy
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.find(params[:id])
		@comment.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 10], ["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]